# Homebrew bundle for this machine.
#
# Usage:
#   brew bundle --file ~/config/Brewfile
#
# Conventions:
# - Keep active entries grouped by purpose.
# - Keep comments short and operational.
# - Prefer removing stale disabled entries over collecting history here.

cask_args appdir: "/Applications"

# Taps
tap "ellie/atuin"
# tap "sumoduduk/tap" # terminusdm — no formulas currently used from this tap

# Core Unix replacements and shell tooling
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "m-cli" # macOS CLI helpers
brew "sd" # fast find/replace
brew "shfmt"
brew "uni" # unicode database

# Dotfiles and machine bootstrap
brew "dotter"
brew "fileicon" # app icon overrides during deploy
brew "mas" # Mac App Store CLI

# Git and repo workflow
brew "git"
brew "gh"
brew "ghq"
brew "git-delta"
brew "lazygit"

# File inspection, search, and navigation
brew "bat"
brew "broot"
brew "dua-cli"
brew "duf"
brew "dust"
brew "eza"
brew "fclones"
brew "fd"
brew "fdupes"
brew "fff"
brew "fselect"
brew "fzf"
brew "television"
brew "jless"
brew "jq"
brew "lf"
brew "lsd"
brew "mdless"
brew "ncdu"
brew "nnn"
brew "poppler"
brew "rclone"
brew "ripgrep"
brew "rga"
brew "rm-improved"
brew "rmrfrs"
brew "sk"
brew "unar"
brew "xplr"

# Editors and terminal-adjacent tools
brew "amp"
brew "atuin"
brew "bottom"
brew "chafa"
brew "glow"
brew "helix"
brew "neovim"
brew "procs"
brew "starship"
brew "viu"
brew "zellij"
tap "itchyny/tap"
brew "itchyny/tap/mmv"

# Media and content tooling
brew "aria2"
brew "bandwhich"
brew "blueutil"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "flac"
brew "kew"
brew "mpv"
brew "ouch"
brew "vapoursynth"
brew "wallpaper"
brew "wget"
brew "yt-dlp"
brew "zstd"

# Development and utilities
brew "aicommits"
brew "bitwise"
brew "binwalk"
brew "bingrep"
brew "cloc"
brew "diskonaut"
brew "f3"
brew "hevi"
brew "moreutils" # includes vidir
brew "pastel"
brew "prettier"
brew "rnr"
brew "rustscan"
brew "ssss"
brew "tokei"
brew "trippy"
brew "age"

# Fonts
cask "font-ark-pixel-10px-monospaced"
cask "font-ark-pixel-12px-monospaced"
cask "font-ark-pixel-16px-monospaced"
cask "font-gohufont-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "sf-symbols"

# Core desktop apps
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "iina"
cask "journey"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kitty"
cask "ledger-wallet"
cask "localsend"
cask "losslesscut"
cask "marta"
cask "monitorcontrol"
cask "nifty-file-lists"
cask "numi"
cask "openinterminal"
cask "signal"
cask "smooze-pro"
cask "spotify"
cask "stats"
cask "supasidebar"
cask "swift-shift"
cask "telegram-desktop"
cask "topnotch"
cask "transnomino"
cask "whatsapp"

# Specialty desktop apps
cask "airflow"
cask "hex-fiend"
cask "jordanbaird-ice"

# AI Tools
# cask "chatgpt"
# cask "chatgpt-atlas" # browser
# cask "codex" # coding agent
# cask "codex-app" # desktop
# cask "codexbar" # usage meter
# cask "nimbalyst" # additional ui for codex and claude code

# Optional ideas worth revisiting
# brew "fq" # jq for binary formats: https://github.com/wader/fq
# cask "alacritty" # alternate terminal
# cask "firefox" # alternate browser
