# run 'brew bundle'

tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/cask-fonts"
#tap "homebrew/core"
tap "homebrew/services"

cask_args appdir: "/Applications"

brew "mas"

brew "git"
brew "git-delta" # rust git diff
brew "gzip"

brew "homebrew/dotter.rb"

brew "rm-improved" # rm replacement (rip)
# brew "clear" # regex file delete
# brew "most" # more replacement (use less -R)
brew "bat" # cat replacement
brew "mdless" # markdown viewer
brew "bk" # ebook reader
brew "exa" # ls replacement
brew "duf" # disk usage go
brew "dust" # better ncdu in rust
brew "dua-cli" # another ncdu rust
brew "ncdu"
brew "fzf" # fuzzy filter (go)
brew "sk" # fuzzy filter (rust)
brew "jq" # json tool

# brew "degit" # git cloner (note: not on brew)

brew "lf" # ranger, but in c
brew "rclone" # disk clone (cloud)
brew "rg" # ripgrep
brew "rga" # ripgrep-all (search pdf, zip etc)
brew "fd" # find
brew "neovim" # editor
brew "helix" # editor
brew "kakoune" # editor
brew "youtube-dl"
brew "ffmpeg" # for youtube-dl
brew "wget"
brew "bandwhich" # bandwidth monitor
brew "diskonaut" # disk usage
brew "zellij" # tmux replacement
brew "chafa" # sixel
brew "viu" # sixel
brew "mpv"
brew "procs" # ps replacement (rust)
brew "macchina" # system info

brew "ouch" # general decompressor (rust)

cask "megasync" # mega.nz

# encryption
brew "age"
brew "ssss" # shamirs secret sharing scheme (multikey)

# development
#	brew "cargo-nextest" # testing NEVER INSTALL THIS, brew should never manage uust EVERQ
brew "prettier"
brew "tokei" # loc
brew "pastel" # colors
brew "aicommits" # gpt generated commit messages

# yabai + skhd
# tap "koekeishiya/formulae"
# tap "jorpilo/formulae" # replacement for koekeishiya
# brew "koekeishiya/formulae/skhd" # brew services start skhd
# brew "koekeishiya/formulae/yabai"

# tabs
# tap "austinjones/taps"
# brew "tab"

# mas "", id: 1521432881 # session pomodoro timer

# atuin (history db)
tap "ellie/atuin"
brew "atuin"

# network
brew "rustscan" # port scanner

# fonts
cask "font-ark-pixel-10px-monospaced"
cask "font-ark-pixel-12px-monospaced"
cask "font-ark-pixel-16px-monospaced"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-gohufont-nerd-font"

cask "kitty" # term
cask "alacritty" # term
cask "1password" # password manager
cask "1password-cli"
# cask "hammerspoon"

cask "smooze-pro"

# utils
# cask "daisydisk"

# bitcoin
cask "bluewallet"
cask "sparrow"
cask "ledger-live"

# browser
cask "firefox"
cask "mullvad-browser" # firefox-based privacy browser

# music
cask "spotify"

cask "numi" # calculator
cask "caffeine" # sleep prevention

# messaging
cask "signal"
cask "telegram-desktop"
cask "session", target: 'Session Desktop.app' # signal fork with private keys instead of phone numbers

# reversing
brew "binwalk" # binary analyser
brew "bingrep" # binary analyser
brew "radare2" # debugger / decompiler
cask "cutter" # debugger / compiler
cask "coretto" # jdk alternative by amazon
cask "ghidra" # debugger / decompiler
brew "rizin" # fork of radare2
cask "temurin" # jre replacement (for ghidra)
brew "bitwise" # bit conversion
brew "demumble" # demangling
cask "hex-fiend" # hex editor
